using System;
using System.Collections.Generic;
using System.Linq;
using System.Runtime.Serialization;
using System.ServiceModel;
using System.Text;

namespace UkrHistoryService1
{
    // ПРИМЕЧАНИЕ. Команду "Переименовать" в меню "Рефакторинг" можно использовать для одновременного изменения имени класса "UkrHistoryService" в коде и файле конфигурации.
    public class UkrHistoryService : IUkrHistoryService
    {
        public string FindEvents(string a)
        {
            string b ="";
           
            switch(a)
            {
                case "1900":
                    b = "1900, 1 травня. — У Харкові відбулася перша в Україні велика (10 тис. чол.) політична демонстрація робітників.\n1900, 16 червня. — В Одесі відбувся нелегальний Всеросійський з'їзд студентів, в роботі якого брали участь представники студентів Москви, Петербурга, Києва, Харкова. Делегати з'їзду були заарештовані поліцією.";
                    break;
                case "1901":
                    b = "1901, 11 січня. — Опубліковано розпорядження царського уряду про віддання в солдати 183 студентів Київського університету за участь у революційному русі.";
               break;
                case "1902":
               b = "1902, березень — квітень. — У Полтавській та Харківській губерніях сталися масові антипоміщицькі виступи селян. Після їх придушення власті притягнули до суду понад тисячу селян.\n1902, червень — серпень. — У Східній Галичині пройшли масові (100 тис. учасників) антипоміщицькі виступи селян.\n1902. — Відбувся І з'їзд Революційної української партії, на якому обрані керівні органи — Центральний, Закордонний та Редакційний комітети на чолі з Д. Антоновичем, В. Винниченком, Є. Голіцинським.\n1902, друга половина року. — У Криму створено “Кримський Союз РСДРП”, який об'єднав місцеві соціал-демократичні організації.";
                break;
                case "1903":
                b = "1903. — Британське біблійське товариство здійснило у Відні перше повне видання Біблії українською мовою у перекладі П. Куліша, І. Пулея, І. Нечуя-Левицького.";
                break;
                case "1904":
                b = "1904, лютий — травень. — У містах України сталися масові антивоєнні демонстрації з протестом проти російсько-японської війни і з вимогами повалення самодержавства.\n1904. — Композитор М. В. Лисенко створив у Києві музично-драматичну школу — перший в Україні театральний навчальний заклад.";
                break;
                case "1905":
                b = "1905,січень — березень. — У губерніях України пройшли масові селянські виступи.\n1905, 14—25 червня. — На панцернику “Князь Потемкин-Таврический” сталося повстання, яке перекинулося на інші кораблі Чорноморського флоту, охопивши дві тисячі матросів. Після придушення повстання понад 100 матросів було притягнуто до суду, кілька з них страчено.\n1905, 7 жовтня. — Почався Всеросійський жовтневий політичний страйк, в якому взяло участь понад 20 тис. робітників України.\n1905, жовтень—листопад. — У містах і робітничих селищах України утворилися ради робітничих депутатів (у жовтні — в Києві, Катеринославі; в листопаді — в Єнакієвому, Миколаєві, Одесі).\n";
                break;
                case "1907":
                b = "1907, січень. — На мешканців Галичини поширено виборче право, внаслідок чого до австрійського парламенту обрано 21 депутата-українця. 1907, 11 травня. — У Києві з ініціативи М. Грушевського засновано Українське наукове товариство. (В 1921 р. увійшло до складу Української академії наук.) 1907. — М. Садовський створив у Києві перший стаціонарний український театр. 1907. — Здійснено перше повне видання творів Т. Шевченка (за ред. В. Доманицького). 1907—1909. — У Києві побачило світ перше видання чотиритомної праці Б. Грінченка “Словарь української мови”.";
                break;
                case "1908":
                b = "1908, 9 квітня. — У Станіславі створено Головний січовий комітет (голова — К. Трильовський, генеральний секретар — І. Чупрей). 1908, травень. — Царський уряд відхилив законопроект, запропонований 37 депутатами Думи, про дозвіл викладання українською мовою у початкових школах на територіях з “малоруським населенням”.\n1908. — У Києві створено Товариство українських поступовців (ТУП).";
                break;
                case "1911":
                b = "1911, 1 вересня. — У Києві есер Д. Богров здійснив замах на прем'єр-міністра Росії відомого реформатора П. Столипіна, який 5 вересня помер. Його поховано у Києві.";
                break;
                case "1912":
                b = "1912. грудень. — У Львові відбувся з'їзд делегатів від “Січей”, на якому засновано Український січовий союз.";
                break;
                case "1913":
                b = "1913, 23 лютого. — В Україні вперше відзначався Міжнародний жіночий день.";
                break;
                case "1914":
                b = "1914, 1 березня. — П. Нестеров здійснив перший авіапереліт на велику відстань за маршрутом Київ—Одеса. \n1914, 18 березня. — У Львові засновано українське військове товариство “Січові стрільці” (голова — В. Старосольський). \n1914,19 липня. — Німеччина оголосила війну Росії. Почалася Перша світова війна.\n 1914, 31 липня. — Царський уряд видав указ про заборону друкування видань українською мовою.\n 1914, 2 серпня. — У Львові за участю представників українських політичних партій Галичини створено Головну Українську Раду з метою побудови самостійної України (голова — К. Левицький).\n1914, серпень—вересень. — У Галичині на основі постанови Головної української ради почалася організація військових і формування українського легіону Січових стрільців, до якого було зараховано 2500 добровольців. 1914, 18 серпня — 21 вересня. — Відбулася Галицька битва військ Росії та Австро-Угорщини, почалося захоплення російськими військами Східної Галичини.\n1914, 22 серпня. — Російські війська зайняли Львів, який до 21 червня 1915 р. перебував під їхньою владою.";
                break;
                case "1915":
                b = "1915, квітень — серпень. — Російські війська залишили територію Галичини.\n1915, 5 травня. — У Відні відбулося перше засідання створеної К. Левицьким “Загальної Української Ради”, що виникла на основі об'єднання “Головної Української Ради” і “Союзу визволення України” з метою посилення боротьби за незалежність України.";
                break;
                case "1916":
                b = "1916, 22 травня — 31 липня. — Російські війська здійснили наступ на Південно-Західному фронті і зайняли Південну Галичину і Буковину.";
                break;
                case "1917":
                b = "1917. 27 лютого. — У Росії перемогла Лютнева революція, повалено самодержавство. 1917, 2—9 березня. — У Харкові, Києві, Катеринославі, Кременчуці, Олександрівську, Юзівці, Макіївці, Севастополі, Полтаві, Миколаєві, Одесі, Херсоні, Вінниці, Луганську, Житомирі виникли Ради робітничих депутатів.\n1917, 4 березня. — У Києві з представників українських громадських організацій створено Центральну Раду (М. Грушевський, Д. Антонович, В. Науменко, Д. Дорошенко), яка перетворилася на головний чинник української демократичної революції 1917—1920 рр.\n1917, 16—21 травня. — У Петрограді відбулися переговори між українською делегацією на чолі з В. Винниченком та представниками Тимчасового уряду, які негативно поставилися до вимог автономії України.\n1917, 10 червня. — У Києві на заключному засіданні II Українського військового з'їзду В. Винниченко оголосив текст 1-го Універсалу Центральної Ради. В ньому сформульована вимога до Тимчасового уряду про надання Україні національно-територіальної автономії. 1917, 15 червня. — Центральна Рада створила Генеральний Секретаріат ради в складі дев'яти осіб — перший український уряд, який очолив В. Винниченко.\n1917, 3—6 жовтня. — У Чигирині відбувся Всеукраїнський з'їзд вільного козацтва, учасники якого (200 чол.) затвердили статут організації, обрали Генеральну раду на чолі з генералом П. Скоропадським.\n1917, 29—31 жовтня. — У Києві спалахнуло кероване більшовиками повстання робітників та солдатів під гаслом встановлення радянської влади.\n1917, 9 листопада. — У Києві відбулося святкування дня проголошення Української Народної Республіки (мітинг, молебень, військовий парад).";
                break;
                case "1918":
                b = "1918, 12 січня. — На відкритому засіданні Центральної ради прийнято 4-й Універсал, який проголосив, що віднині УНР стає самостійною, від нікого незалежною, суверенною державою українського народу.\n1918, 16—22 січня. — У Києві сталося збройне повстання робітників проти Центральної Ради, яке було придушено після вступу до міста українських військових частин на чолі з С. Петлюрою.\n1918, 29 січня. — Під Крутами відбувся бій між частинами Центральної Ради та більшовицькими військами. В бою брали участь і 120 студентів та гімназистів Києва, 47 з них були вбиті. 27 з них пізніше були поховані в Києві біля Аскольдової могили.\n1918,19 лютого — Після звернення уряду УНР з проханням про допомогу у боротьбі з більшовиками почався наступ німецьких військ на Україні. В цей день німецькі війська з'єдналися з військами Центральної Ради у Новограді-Волинському.\n1918, 1 березня. — Київ захопили німецькі війська.\n1918, 25 березня. — Німеччина та Австро-Угорщина підписали Конвенцію про поділ території України на дві зони впливу — австрійську та німецьку.\n1918, 16 жовтня. — У Києві видано універсал гетьмана П. Скоропадського про відродження козацтва.\n1918, 27 листопада. — У Києві засновано Українську академію наук. Першим президентом УАН став видатний учений В. Вернадський.\n1918, 14 грудня. — П. Скоропадський відмовився від гетьманської посади і втік до Німеччини. Директорія у Києві проголосила свою владу.";
                break;
                case "1919":
                b = "1919, 16 січня. — Директорія оголосила війну РСФРР.\n1919, квітень — червень. — Війська Чехословаччини захопили Закарпатську Україну.\n1919, квітень — червень. — Наддніпрянську Україну захопили війська Денікіна.\n1919, 31 серпня. — Денікінські війська захопили Київ.\n";
                break;
                case "1920":
                b = "1920, 21 вересня. — РНК УСРР прийняв постанову про обов'язкове вивчення української мови в школах з неукраїнською мовою викладання.\n1920, 28 грудня. — У Москві підписано робітничо-селянський союзний договір між УСРР та РСФРР про військовий та господарський союз із взаємним визнанням суверенітету та незалежності республік.";
                break;
                case "1921":
                b = "1921, осінь — 1922, весна. — У південних районах України був голод, викликаний посухою, розрухою господарства внаслідок війни і політики “воєнного комунізму”.";
                break;
                case "1922":
                b = "1922, 30 грудня. — Відбувся І з'їзд Рад СРСР за участю представників РСФРР, УСРР, БСРР, Закавказької ФРР, де прийнято договір про утворення Радянського Союзу.";
                break;
                case "1923":
                b = "1923, 26 січня. — У Харкові створено спілку пролетарських письменників “Гарт”.";
                break;
                case "1924":
                b = "1924, 31 липня. — Польський уряд заборонив використання української мови в державних установах Західної України.";
                break;
                case "1925":
                b = "1925. — У Києві збудовано перший в СРСР пасажирський літак К-1.";
                break;
                case "1926":
                b = "1926. — У Києві створено Асоціацію художників Червоної України — творче об'єднання художників республіки.";
                break;
                case "1927":
                b = "1927, 8 листопада. — У Запоріжжі розпочалося будівництво велетня електрифікації— Дніпровської ГЕС (Дніпрогес). Будівництво завершено в березні 1932 р.";
                break;
                case "1928":
                b = "1929, 27 січня — 3 лютого. — У Відні відбувся І Конгрес українських націоналістів, на якому створено Організацію українських націоналістів (ОУН), провід якої очолив Є. Коновалець.";
                break;
                case "1930":
                b = "1930, 9 березня — 19 квітня. — У Києві відбувся сфальсифікований судовий процес над великою групою української інтелігенції, яку звинувачували у створенні підпільної організації “Спілка визволення України”. 45 учених, письменників на чолі з віце-президентом АН УСРР С. Єфремовим були засуджені на різні строки ув'язнення.";
                break;
                case "1931":
                b = "1931, жовтень. — У Харкові став до ладу тракторний завод, який випустив перші в Україні трактори.\n1931. — Створено Українську студію хронікально-документальних фільмів.";
                break;
                case "1932":
                b = "1932, жовтень — 1933, квітень. — Україну охопив масовий голод, викликаний політикою насильницької колективізації. Прямі людські втрати від голодомору перевищили 3,5 млн осіб (за деякими даними — 4,9 млн)";
                break;
                case "1933":
                b = "1933, 10 березня. — На основі постанови РНК УСРР у Києві, Харкові, Одесі та Дніпропетровську відновлено діяльність державних університетів.";
                break;
                case "1934":
                b = "1934, 10 червня. — При НКВС УСРР створено горезвісне Головне управління виправно-трудових таборів (рос. — ГУЛАГ), через які пройшли мільйони ув'язнених.";
                break;
                case "1936":
                b = "1936, жовтень — 1938, листопад. — Чергова смуга масового терору в Україні, жертвами якого стали мільйони людей.";
                break;
                case "1937":
                b = "1937, 25—30 січня. — Відбувся Надзвичайний XIV Всеукраїнський з'їзд Рад, який схвалив нову Конституцію УРСР.";
                break;
                case "1938":
                b = "1938, 27 жовтня. — На І з'їзді художників УРСР створена Спілка радянських художників республіки.";
                break;
                case "1939":
                b = "1939, 23 серпня. — У Москві міністри закордонних справ Німеччини та СРСР Ріббентроп і В. Молотов підписали німецько-радянський пакт про ненапад. Таємний протокол, що додавався до нього, передбачав розподіл Європи на сфери інтересів цих країн. Західна Україна була віднесена до сфери інтересів Радянського Союзу.\n1939, 1 вересня. — Німеччина здійснила напад на Польщу. Німецька авіація завдала ударів по західноукраїнських містах: Львову, Тернополю, Луцьку. В цей день почалася Друга світова війна.\n1939, грудень — 1940, липень. — Сталися три хвилі масової депортації населення із Західної України до південно-східних районів РРФСР. Було депортовано близько 800 тис. осіб.";
                break;
                case "1940":
                b = "1940, 28 червня. — Румунія погодилася на передачу СРСР Південної Буковини і Бессарабії. Ці території були включені до складу УРСР.";
                break;
                case "1941":
                b = "1941, 22 червня. — Німеччина напала на Радянський Союз. У цей день Київ та інші міста УРСР зазнали бомбардувань.\n1941, 29—30 вересня. — У Києві у Бабиному яру німецько-фашистські окупанти розстріляли понад 150 тис. мирних жителів міста (в основному євреїв), а також військовополонених.\n1941, 30 жовтня — 1942, 4 липня. — Героїчна оборона Севастополя військами Приморської армії та Чорноморського флоту.";
                break;
                case "1942":
                b = "1942, 13 лютого. — Початок масового примусового вивезення населення України до Німеччини (вивезено 2 млн чол.).";
                break;
                case "1943":
                b = "1943. — Рік масового визволення українських міст та сіл (23 серпня — Харків, 2 вересня — Суми, 8 вересня — Сталіно, 21 вересня — Чернігів, 23 вересня — Полтава, 14 жовтня — Запоріжжя, 25 жовтня — Дніпропетровськ, 6 листопада — Київ, 14 грудня — Черкаси, 31 грудня — Житомир).";
                break;
                case "1944":
                b = "1944. — Рік повного визволення України від окупантів (8 січня — Кіровоград, 2 лютого — Луцьк, Рівне, 13 березня —Херсон, 20 березня— Вінниця, 28 березня — Миколаїв, 29 березня — Чернівці, 10 квітня — Одеса, 13 квітня — Сімферополь, 15 квітня — Тернопіль, 27 липня — Львів, Станіслав, 6 серпня — Дрогобич, 27 жовтня — Ужгород).\n1944, 26 листопада. — З'їзд народних депутатів Закарпаття, який відбувся в м. Мукачевому, прийняв Маніфест про возз'єднання Закарпатської України з УРСР.";
                break;
                case "1945":
                b = "1945, 8 травня. — Підписано Акт про беззастережну капітуляцію Німеччини у Другій світовій війні.\n1945, 26 червня. — У Москві Чехословаччина підписала договір, за яким Закарпатська Україна відійшла до СРСР і стала частиною УРСР.\n1945, 2 вересня. — Підписано Акт про беззастережну капітуляцію Японії у Другій світовій війні.";
                break;
                case "1946":
                b = "1946, 8—10 березня. — Собор греко-католицької церкви у Львові під тиском властей скасував унію з Ватиканом і підпорядкував греко-католицьку церкву в Україні Російській православній церкві.";
                break;
                case "1947":
                b = "1947, 28 квітня — 31 липня. — У Польщі проведено сумнозвісну операцію “Вісла”, яка була апогеєм насильницької депортації громадян Польщі українського походження. Офіційна мета операції — “остаточно вирішити українську проблему в Польщі”. За три місяці депортовано 150 тис. осіб.";
                break;
                case "1948":
                b = "1948, 1 жовтня. — Введено до ладу найпотужніший в Європі газопровід Дашава—Київ, чим покладено початок масовій газифікації населених пунктів України.";
                break;
                case "1950":
                b = "1950 — 1951. — У Львові відбулися масові арешти органами КДБ викладачів і студентів вузів, яких звинувачували в антирадянській діяльності.";
                break;
                case "1951":
                b = "1951, 7 листопада. — У Києві почав працювати перший в УРСР телевізійний центр.";
                break;
                case "1953":
                b = "1953, 5 листопада. — У Києві завершено будівництво першого в світі суцільнозварного моста (через р. Дніпро), збудованого за проектом академіка Є. Патона.";
                break;
                case "1954":
                b = "1954, 19 лютого. — Президія Верховної Ради СРСР прийняла Указ про передачу Кримської області із складу РРФСР до складу УРСР.\n1954, 12 травня. — УРСР стала членом ЮНЕСКО і Міжнародної організації Праці.";
                break;
                case "1955":
                b = "1955, 18 жовтня. — У Херсонській області стала до ладу Каховська ГЕС.";
                break;
                case "1956":
                b = "1956, лютий. — У Ворошиловграді на металургійному заводі збудовано найбільшу в Європі 600-тисячну мартенівську піч.";
                break;
                case "1957":
                b = "1957, 27 червня. — Став до ладу газопровід Шебелинка — Дніпропетровськ-1957, 17 грудня.— ЦК Компартії України і Рада Міністрів УРСР прийняли спільну постанову про видання Української Радянської Енциклопедії.";
                break;
                case "1958":
                b = "1958, 14 березня. — В Інституті математики АН УРСР (м. Київ) розроблено універсальну обчислювальну машину “Київ”.";
                break;
                case "1959":
                b = "1959, 15 жовтня. — У Мюнхені агент КДБ СРСР Б. Сташинський убив провідника ОУН С. Бандеру.";
                break;
                case "1960":
                b = "1960, 6 листопада. — У Києві почав діяти перший в УРСР метрополітен.";
                break;
                case "1961":
                b = "1961, 31 жовтня. — У Дніпропетровській області дала струм найбільша в Україні теплова електростанція — Придніпровська ДРЕС, яка почала працювати на повну потужність у листопаді 1966 р.";
                break;
                case "1962":
                b = "1962, 11—15 серпня. — В СРСР здійснено космічний політ за участю першого українського космонавта П. Поповича.\n";
                break;
                case "1964":
                b = "1964, 29 травня. — У Києві відкрився новий ботанічний сад, найбільший в Європі.";
                break;
                case "1965":
                b = "1965, 18 вересня. — Постановою Ради Міністрів УРСР на острові Хортиця (м. Запоріжжя) засновано заповідник з історії українського козацтва.";
                break;
                case "1966":
                b = "1966, 7 серпня. — Введено в експлуатацію Дніпродзержинську ГЕС у Дніпропетровській області.";
                break;
                case "1967":
                b = "1967, 1 березня. — У Запоріжжі на заводі “Комунар” розпочався серійний випуск легкових автомобілів “Запорожець-966”.";
                break;
                case "1976":
                b = "1976, 17 липня. — У Києві відкрито для відвідування Музей народної архітектури та побуту УРСР, в якому встановлено понад 150 споруд — пам'яток української архітектури XVI—XX ст. (засновано у 1969 р.)\n";
                break;
                case "1985":
                b = "1985, грудень. — Видавництво “Наукова думка” АН УРСР завершило видання десятитомної “Історії Української РСР”.";
                break;
                case "1986":
                b = "1986, 26 квітня. — Сталася аварія на Чорнобильській атомній станції, внаслідок чого радіоактивної забрудненості зазнала територія, на якій в 2218 населених пунктах проживало 2,4 млн чол. Від аварії постраждало 3,2 млн громадян УРСР, у тому числі 1,18 млн дітей. Збитки України від аварії становлять 120—130 млрд доларів.\n1986, 31 серпня. — Внаслідок аварії в Чорному морі затонуло пасажирське судно “Адмірал Нахімов”. Більшість пасажирів загинула.";
                break;
                case "1989":
                b = "1989, 28 жовтня. — Верховна Рада УРСР схвалила Закон “Про державний статус української мови”.";
                break;
                case "1990":
                b = "1990, 23 липня. — Верховна Рада УРСР на альтернативній основі обрала Головою Верховної Ради Л. Кравчука.\n1990, 24 липня. — За рішенням Президії Київської міської Ради народних депутатів над будинком Ради на Хрещатику о 19 годині піднято поруч з державним прапором УРСР національний синьо-жовтий прапор.\n1990, 3 серпня. — Верховна Рада УРСР ухвалила Закон “Про економічну самостійність Української РСР”.\n";
                break;
                case "1991":
                b = "1991, 24 серпня — поворотна дата в історії України: в цей день позачергова сесія Верховної Ради УРСР прийняла історичний Акт про державну незалежність України, який відкрив новий етап в історії країни.\n1991, 30 серпня. — Президія Верховної Ради України прийняла Указ про заборону діяльності Комуністичної партії України.\n1991, 24 жовтня. — Верховна Рада України схвалила заяву про без'ядерний статус України.\n1991, 1 листопада. — Верховна Рада України прийняла Декларацію прав національностей України.";
                break;
                case "1992":
                b = "1992, 15 січня. — Верховна Рада України затвердила Державний гімн. Ним став гімн “Ще не вмерла Україна”, створений у 1864 р. композитором М. Вербицьким.\n1992, 28 січня. — Верховна Рада України затвердила новий прапор України у вигляді двоколірного полотнища, верхня частина якого синя, нижня — жовта.\n1992, 14 липня. — Україна подала заяву про вступ до Ради Європи.";
                break;
                case "1993":
                b = "1993, 19 червня. — У Донецьку відбувся з'їзд Компартії України, на якому оголошено про відновлення діяльності партії.";
                break;
                case "1994":
                b = "1994, 18 травня. — Головою Верховної Ради України обрано О. Мороза. 1994, 10 липня. — У другому турі виборів Президентом України обрано Л.Кучму.\n";
                break;
                case "1995":
                b = "1995, 31 жовтня. — Рішенням Верховної Ради Україна приєдналася до Ради Європи. Враховуючи Рекомендацію Парламентської Асамблеї та запрошення Комітету міністрів Ради Європи, Україна стала повноправним членом Ради Європи.";
                break;
                case "1996":
                b = "1996, 1 вересня. — В Україні запроваджена нова національна валюта — гривня.";
                break;
                case "1997":
                b = "1997, 19 листопада. — Стартував американський космічний корабель “Колумбія”, у складі міжнародного екіпажу якого був перший космонавт незалежної України Л. Каденюк. Після 16 діб польоту і успішного виконання програми екіпаж благополучно повернувся на Землю.";
                break;
                case "1998":
                b = "1998, 20 вересня. — Україна відзначила 1100-річчя від дня заснування Галича, колишньої столиці могутньої держави — Галицько-Волинського князівства. Свято проводилося під егідою ЮНЕСКО.\n1998, листопад. — Указом Президента України в державі встановлено День пам'яті жертв голодомору, який відзначатиметься щорічно у четверту суботу листопада. Від голоду 1921 р. та 1946—1947 рр., голодомору 1932— 1933 рр. в Україні загинуло близько 15 млн осіб.";
                break;
                case "1999":
                b = "1999, 21 січня. — Президент України, враховуючи велике політичне та історичне значення об'єднання Української Народної Республіки і Західноукраїнської Народної Республіки для утворення єдиної (соборної) Української держави, своїм указом встановив День Соборності України, який відзначатиметься щорічно 22 січня — у день проголошення в 1919 р. Акта злуки.";
                break;
                case "2000":
                b = "2000, 22 лютого.— В Україні відмінено смертну кару. В цей день Верховна Рада України більшістю голосів скасувала положення про смертну кару в Кримінальному, Кримінально-процесуальному та Виправно-трудовому кодексах, а також ратифікувала Протокол № 6 Конвенції про захист прав і основних свобод людини 1983 р., що стосується скасування смертної кари.\n2000, 24 липня. — Ця дата проголошена Днем національного прапора України. 10 років тому над будинком Київської Ради піднято національний синьо-жовтий прапор. Ця подія, яка сталася через тиждень після ухвалення Верховною Радою України Декларації про державний суверенітет України, символізувала вступ країни на новий шлях розвитку.";
                break;
                default:
                    b = "Ніякої інформації не знайдено";
                    break;


            }
            return b;
        }
    }
}
